formal/formal-summary.org
#+TITLE: Formal Methods Summary
#+OPTIONS: H:5
#+STARTUP: showeverything

This document briefly summarizes current formal method groups, proof
systems, projects and researchers. For each it gives pointers for
further information. It is a work-in-progress and is necessarily
incomplete.

* Formal Methods Research Groups
** DeepSpec Project
- Home Page :: https://deepspec.org

** Galois Inc
- Home Page :: https://galois.com/
- Sources :: https://github.com/GaloisInc

** Yale FLINT Group
- Home Page :: http://flint.cs.yale.edu/flint/
- Publications:
  - https://www.cs.purdue.edu/homes/suresh/590s-Fall2002/papers/Flintoverview.pdf

"The FLINT group at Yale aims to develop a novel and practical
programming infrastructure for constructing large-scale certified
systems software. By combining recent new advances in programming
languages, formal semantics, certified operating systems, program
verification, proof assistants and automation, language-based
secrurity, and certifying compilers, we hope to attack the following
research questions:

- what system software structures can offer the best support for extensibility, security, and resilience?
- what program logics and semantic models can best capture these abstractions?
- what are the right programming languages and environments for developing such certified system software?
- how to build new automation facilities to make certified software really scale?"

** Everest Expedition
- Home Page :: https://project-everest.github.io/
- Source :: https://github.com/project-everest

"We are a team of researchers and engineers from several
organizations, including Microsoft Research, Carnegie Mellon
University, INRIA, and the MSR-INRIA joint center.

Everest is a recursive acronym: It stands for the “Everest VERified
End-to-end Secure Transport”."

* Formal Methods Proof Systems
** Coq
- Home Page :: https://coq.inria.fr/
- Source :: https://github.com/coq/coq.git

Coq is a formal proof management system. It provides a formal language
to write mathematical definitions, executable algorithms and theorems
together with an environment for semi-interactive development of
machine-checked proofs. Typical applications include the certification
of properties of programming languages (e.g. the CompCert compiler
certification project, or the Bedrock verified low-level programming
library), the formalization of mathematics (e.g. the full
formalization of the Feit-Thompson theorem or homotopy type theory)
and teaching.

** KeYmaeraX
- Home Page :: http://www.ls.cs.cmu.edu/KeYmaeraX/
- Source :: https://github.com/LS-Lab/KeYmaeraX-release

** Isabelle
** HOL
- Home Page :: https://hol-theorem-prover.org/
- Source :: https://github.com/HOL-Theorem-Prover

** HOL-Light
- Home Page :: https://www.cl.cam.ac.uk/~jrh13/hol-light/
- Source :: https://github.com/jrh13/hol-light/

** Daphny
** Boogie
** Why3
** Frama-C
** F*
** LEAN

* Formal Methods Projects

** DeepSpec Projects

*** CompCert
- Home Page :: http://compcert.inria.fr
- Source :: https://github.com/AbsInt/CompCert.git

The CompCert C verified compiler is a compiler for a large subset of
the C programming language that generates code for the PowerPC, ARM,
x86 and RISC-V processors.

The distinguishing feature of CompCert is that it has been formally
verified using the Coq proof assistant: the generated assembly code is
formally guaranteed to behave as prescribed by the semantics of the
source C code.

