formal/formal-summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-21 Wed 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formal Methods Summary</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="SS-FORDR-LAP" />
</head>
<body>
<div id="content">
<h1 class="title">Formal Methods Summary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org27d00a9">1. Formal Methods Research Groups</a>
<ul>
<li><a href="#orgbf0b179">1.1. DeepSpec Project</a></li>
<li><a href="#org3b0a1f0">1.2. Galois Inc</a></li>
<li><a href="#orged31fcc">1.3. Yale FLINT Group</a></li>
<li><a href="#org9b5b1d9">1.4. Everest Expedition</a></li>
</ul>
</li>
<li><a href="#org8a9fef4">2. Formal Methods Proof Systems</a>
<ul>
<li><a href="#org24cfaa0">2.1. Coq</a></li>
<li><a href="#org911e0b0">2.2. KeYmaeraX</a></li>
<li><a href="#org49a38c0">2.3. Isabelle</a></li>
<li><a href="#org4a2eef8">2.4. HOL</a></li>
<li><a href="#orge92e58a">2.5. HOL-Light</a></li>
<li><a href="#orgfcbf305">2.6. Daphny</a></li>
<li><a href="#orgb45fd3f">2.7. Boogie</a></li>
<li><a href="#org58fd6c2">2.8. Why3</a></li>
<li><a href="#org50edf95">2.9. Frama-C</a></li>
<li><a href="#org74bdac2">2.10. F*</a></li>
<li><a href="#orgd4d02eb">2.11. LEAN</a></li>
</ul>
</li>
<li><a href="#org2f58a6d">3. Formal Methods Projects</a>
<ul>
<li><a href="#org5596aa8">3.1. DeepSpec Projects</a>
<ul>
<li><a href="#orgee2f6dc">3.1.1. CompCert</a></li>
<li><a href="#orgacf8338">3.1.2. Verified Software Toolchain</a></li>
<li><a href="#orgc0ed4f9">3.1.3. CertiKOS - Certified Kit Operating System</a></li>
<li><a href="#org6e1cf0c">3.1.4. VeriML</a></li>
<li><a href="#org2a69e9a">3.1.5. Certifying Low-Level Programs with Hardware Interrupts and Preemptive Threads</a></li>
<li><a href="#org643b5c2">3.1.6. Kami</a></li>
<li><a href="#org8d0d72b">3.1.7. Haskell Core Spec</a></li>
<li><a href="#org059cfc6">3.1.8. Deep Spec Server</a>
<ul>
<li><a href="#org8618f94">3.1.8.1. GNU Libmicrohttpd</a></li>
</ul>
</li>
<li><a href="#org7b36d71">3.1.9. Kami</a></li>
<li><a href="#orgc3a8fcd">3.1.10. Verdi</a></li>
<li><a href="#org15eb98e">3.1.11. Vellvm</a></li>
<li><a href="#orgeb5f924">3.1.12. Deep Spec Crypto</a></li>
<li><a href="#orgbebcf31">3.1.13. DeepSpecDb</a></li>
<li><a href="#org457454e">3.1.14. Fiat</a></li>
<li><a href="#orgf74a63e">3.1.15. Narcissus</a></li>
<li><a href="#org41491e4">3.1.16. CertiCoq</a></li>
<li><a href="#orge3b4151">3.1.17. Template-Coq</a></li>
<li><a href="#org70e9c11">3.1.18. QuickChick</a></li>
<li><a href="#orge5f96bb">3.1.19. Galois Voting System</a></li>
</ul>
</li>
<li><a href="#orgf20d2ba">3.2. Non-DeepSpec Projects</a>
<ul>
<li><a href="#org15ad727">3.2.1. CakeML</a></li>
<li><a href="#org6130d35">3.2.2. VCC - A verifier for Concurrent C</a></li>
<li><a href="#org25a1d24">3.2.3. Compositional CompCert</a></li>
<li><a href="#orgbc53d44">3.2.4. GaloisInc Projects</a></li>
<li><a href="#org5ea7477">3.2.5. Bedrock</a></li>
<li><a href="#org8e91acb">3.2.6. FSCQ</a></li>
<li><a href="#orgb74bde2">3.2.7. Ur/Web</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga683e5a">4. Formal Methods Researchers</a>
<ul>
<li><a href="#org0f4e153">4.1. Andrew W Appel</a></li>
<li><a href="#org81f9ee6">4.2. Adam Chlipala</a></li>
<li><a href="#org6e95bd1">4.3. Robert Harper</a></li>
<li><a href="#orgcef1342">4.4. Benjamin Pierce</a></li>
<li><a href="#orge613bc1">4.5. Zhong Shao</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document briefly summarizes current formal method groups, proof
systems, projects and researchers. For each it gives pointers for
further information. It is a work-in-progress and is necessarily
incomplete.
</p>

<div id="outline-container-org27d00a9" class="outline-2">
<h2 id="org27d00a9"><span class="section-number-2">1</span> Formal Methods Research Groups</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbf0b179" class="outline-3">
<h3 id="orgbf0b179"><span class="section-number-3">1.1</span> DeepSpec Project</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://deepspec.org">https://deepspec.org</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org3b0a1f0" class="outline-3">
<h3 id="org3b0a1f0"><span class="section-number-3">1.2</span> Galois Inc</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://galois.com/">https://galois.com/</a></dd>
<dt>Sources</dt><dd><a href="https://github.com/GaloisInc">https://github.com/GaloisInc</a></dd>
</dl>
</div>
</div>

<div id="outline-container-orged31fcc" class="outline-3">
<h3 id="orged31fcc"><span class="section-number-3">1.3</span> Yale FLINT Group</h3>
<div class="outline-text-3" id="text-1-3">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://flint.cs.yale.edu/flint/">http://flint.cs.yale.edu/flint/</a></dd>
<dt>(no term)</dt><dd>Publications:
<ul class="org-ul">
<li><a href="https://www.cs.purdue.edu/homes/suresh/590s-Fall2002/papers/Flintoverview.pdf">https://www.cs.purdue.edu/homes/suresh/590s-Fall2002/papers/Flintoverview.pdf</a></li>
</ul></dd>
</dl>

<p>
"The FLINT group at Yale aims to develop a novel and practical
programming infrastructure for constructing large-scale certified
systems software. By combining recent new advances in programming
languages, formal semantics, certified operating systems, program
verification, proof assistants and automation, language-based
secrurity, and certifying compilers, we hope to attack the following
research questions:
</p>

<ul class="org-ul">
<li>what system software structures can offer the best support for extensibility, security, and resilience?</li>
<li>what program logics and semantic models can best capture these abstractions?</li>
<li>what are the right programming languages and environments for developing such certified system software?</li>
<li>how to build new automation facilities to make certified software really scale?"</li>
</ul>
</div>
</div>

<div id="outline-container-org9b5b1d9" class="outline-3">
<h3 id="org9b5b1d9"><span class="section-number-3">1.4</span> Everest Expedition</h3>
<div class="outline-text-3" id="text-1-4">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://project-everest.github.io/">https://project-everest.github.io/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/project-everest">https://github.com/project-everest</a></dd>
</dl>

<p>
"We are a team of researchers and engineers from several
organizations, including Microsoft Research, Carnegie Mellon
University, INRIA, and the MSR-INRIA joint center.
</p>

<p>
Everest is a recursive acronym: It stands for the “Everest VERified
End-to-end Secure Transport”."
</p>
</div>
</div>
</div>

<div id="outline-container-org8a9fef4" class="outline-2">
<h2 id="org8a9fef4"><span class="section-number-2">2</span> Formal Methods Proof Systems</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org24cfaa0" class="outline-3">
<h3 id="org24cfaa0"><span class="section-number-3">2.1</span> Coq</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://coq.inria.fr/">https://coq.inria.fr/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/coq/coq.git">https://github.com/coq/coq.git</a></dd>
</dl>

<p>
Coq is a formal proof management system. It provides a formal language
to write mathematical definitions, executable algorithms and theorems
together with an environment for semi-interactive development of
machine-checked proofs. Typical applications include the certification
of properties of programming languages (e.g. the CompCert compiler
certification project, or the Bedrock verified low-level programming
library), the formalization of mathematics (e.g. the full
formalization of the Feit-Thompson theorem or homotopy type theory)
and teaching.
</p>
</div>
</div>

<div id="outline-container-org911e0b0" class="outline-3">
<h3 id="org911e0b0"><span class="section-number-3">2.2</span> KeYmaeraX</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://www.ls.cs.cmu.edu/KeYmaeraX/">http://www.ls.cs.cmu.edu/KeYmaeraX/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/LS-Lab/KeYmaeraX-release">https://github.com/LS-Lab/KeYmaeraX-release</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org49a38c0" class="outline-3">
<h3 id="org49a38c0"><span class="section-number-3">2.3</span> Isabelle</h3>
</div>
<div id="outline-container-org4a2eef8" class="outline-3">
<h3 id="org4a2eef8"><span class="section-number-3">2.4</span> HOL</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://hol-theorem-prover.org/">https://hol-theorem-prover.org/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/HOL-Theorem-Prover">https://github.com/HOL-Theorem-Prover</a></dd>
</dl>
</div>
</div>

<div id="outline-container-orge92e58a" class="outline-3">
<h3 id="orge92e58a"><span class="section-number-3">2.5</span> HOL-Light</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://www.cl.cam.ac.uk/~jrh13/hol-light/">https://www.cl.cam.ac.uk/~jrh13/hol-light/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/jrh13/hol-light/">https://github.com/jrh13/hol-light/</a></dd>
</dl>
</div>
</div>

<div id="outline-container-orgfcbf305" class="outline-3">
<h3 id="orgfcbf305"><span class="section-number-3">2.6</span> Daphny</h3>
</div>
<div id="outline-container-orgb45fd3f" class="outline-3">
<h3 id="orgb45fd3f"><span class="section-number-3">2.7</span> Boogie</h3>
</div>
<div id="outline-container-org58fd6c2" class="outline-3">
<h3 id="org58fd6c2"><span class="section-number-3">2.8</span> Why3</h3>
</div>
<div id="outline-container-org50edf95" class="outline-3">
<h3 id="org50edf95"><span class="section-number-3">2.9</span> Frama-C</h3>
</div>
<div id="outline-container-org74bdac2" class="outline-3">
<h3 id="org74bdac2"><span class="section-number-3">2.10</span> F*</h3>
</div>
<div id="outline-container-orgd4d02eb" class="outline-3">
<h3 id="orgd4d02eb"><span class="section-number-3">2.11</span> LEAN</h3>
</div>
</div>

<div id="outline-container-org2f58a6d" class="outline-2">
<h2 id="org2f58a6d"><span class="section-number-2">3</span> Formal Methods Projects</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5596aa8" class="outline-3">
<h3 id="org5596aa8"><span class="section-number-3">3.1</span> DeepSpec Projects</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgee2f6dc" class="outline-4">
<h4 id="orgee2f6dc"><span class="section-number-4">3.1.1</span> CompCert</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://compcert.inria.fr">http://compcert.inria.fr</a></dd>
<dt>Source</dt><dd><a href="https://github.com/AbsInt/CompCert.git">https://github.com/AbsInt/CompCert.git</a></dd>
</dl>

<p>
The CompCert C verified compiler is a compiler for a large subset of
the C programming language that generates code for the PowerPC, ARM,
x86 and RISC-V processors.
</p>

<p>
The distinguishing feature of CompCert is that it has been formally
verified using the Coq proof assistant: the generated assembly code is
formally guaranteed to behave as prescribed by the semantics of the
source C code.
</p>
</div>
</div>
