formal/formal-summary.org
*** Verified Software Toolchain
- Home Page :: http://vst.cs.princeton.edu/
- Source :: https://github.com/PrincetonUniversity/VST.git

The software toolchain includes static analyzers to check assertions
about your program; optimizing compilers to translate your program to
machine language; operating systems and libraries to supply context
for your program. The Verified Software Toolchain project assures with
machine-checked proofs that the assertions claimed at the top of the
toolchain really hold in the machine-language program, running in the
operating-system context.

In some application domains it is not enough to build reliable
software systems, one wants proved-correct software. This is the case
for safety-critical systems (where software bugs can cause injury or
death) and for security-critical applications (where an attacker is
deliberately searching for, and exploiting, software bugs). Since
proofs are large and complex, the proof-checking must be
mechanized. Machine-checked proofs of real software systems are
difficult, but now should be possible, given the recent advances in
the theory and engineering of mechanized proof systems applied to
software verification. But there are several challenges:

- Real software systems are usually built from components in different
  programming languages.

- Some parts of the program need full correctness proofs, which must
  be constructed with great effort; other parts need only safety
  proofs, which can be constructed automatically.

- One reasons about correctness at the source-code level, but one runs
  a machine-code program translated by a compiler; the compiler must
  be proved correct.

- These proofs about different properties, with respect to different
  programming languages, must be integrated together end-to-end in a
  way that is also proved correct and machine-checked.

We address these challenges by defining Verifiable C, a program logic
for the C programming language. Verifiable C is proved sound with
respect to the operational semantics of CompCert C; in turn, the
CompCert verified optimizing C compiler is proved correct with respect
to the assembly-language semantics of the PowerPC, ARM, and x86
processors.

*** CertiKOS - Certified Kit Operating System
- Home Page :: http://flint.cs.yale.edu/certikos/
- Source :: https://github.com/npe9/certikos.git

Developed by the FLINT group.

*** VeriML
- Home Page :: http://flint.cs.yale.edu/shao/papers/veriml.html
- Source :: http://flint.cs.yale.edu/flint/publications/veriml-0.1.tar.gz
- Paper :: http://flint.cs.yale.edu/flint/publications/verimltr.pdf

Developed by the FLINT group.

Modern proof assistants such as Coq and Isabelle provide high degrees
of expressiveness and assurance because they support formal reasoning
in higher-order logic and supply explicit machine-checkable proof
objects. Unfortunately, large scale proof development in these proof
assistants is still an extremely difficult and time-consuming
task. One major weakness of these proof assistants is the lack of a
single language where users can develop complex tactics and decision
procedures using a rich programming model and in a typeful
manner. This limits the scalability of the proof development process,
as users avoid developing domain-specific tactics and decision
procedures.

In this paper, we present VeriML---a novel language design that
couples a type-safe effectful computational language with first-class
support for manipulating logical terms such as propositions and
proofs. The main idea behind our design is to integrate a rich logical
framework---similar to the one supported by Coq---inside a
computational language inspired by ML. The language design is such
that the added features are orthogonal to the rest of the
computational language, and also do not require significant additions
to the logic language, so soundness is guaranteed. We have built a
prototype implementation of VeriML including both its type-checker and
an interpreter. We demonstrate the effectiveness of our design by
showing a number of type-safe tactics and decision procedures written
in VeriML.

*** Certifying Low-Level Programs with Hardware Interrupts and Preemptive Threads
- Home Page :: http://flint.cs.yale.edu/shao/papers/aimjar.html
- Source :: http://flint.cs.yale.edu/flint/publications/aim.coq.tar.gz
- Local repo :: e/certhwint

Developed by the FLINT group.

*** Kami
- Home Page :: http://plv.csail.mit.edu/kami/
- Source :: https://github.com/mit-plv/kami

Kami is a library that turns Coq into an IDE for digital hardware
development, based on a clean-slate reimplementation of a core of the
[[http://www.bluespec.com/][Bluespec]] language. We span the gap from mathematical specifications to
hardware circuit descriptions (RTL netlists). We support specifying,
implementing, verifying, and compiling hardware, reasoning at a high
level about particular hardware components but in the end deriving
first-principles Coq theorems about circuits. No part of Kami need be
trusted beside the formalization of low-level (Verilog-style) circuit
descriptions; all other aspects have end-to-end correctness proofs
checked by Coq. Hardware designs are broken into separately verified
modules, reasoned about with a novel take on labeled transition
systems. Furthermore, Coq provides a natural and expressive platform
for metaprogramming, or building verified circuit generators, as for a
memory caching system autogenerated for a particular shape of cache
hierarchy, or a CPU generated given a number of concurrent cores as
input.

*** Haskell Core Spec
- Home Page :: https://deepspec.org/entry/Project/Haskell+CoreSpec
- Source :: https://github.com/sweirich/corespec.git

The Haskell CoreSpec Project aims to develop formal specifications for
a high-level, industrially-relevant functional programming
language. In particular, this project targets the core language of the
Glasgow Haskell Compiler, the primary compiler for the Haskell
programming language. GHC has long been used as both an industrial
strength compiler and a platform for language research. The compiler
itself is open source, and has primarily been developed and is
currently maintained by researchers at Microsoft Research,
Cambridge. The CoreSpec project will develop a formal Coq
specification of the GHC Core language, including the syntax, type
system, and semantics, and connect that specification to other
components of the DeepSpec project.

