formal/formal-summary.html

<div id="outline-container-orgacf8338" class="outline-4">
<h4 id="orgacf8338"><span class="section-number-4">3.1.2</span> Verified Software Toolchain</h4>
<div class="outline-text-4" id="text-3-1-2">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://vst.cs.princeton.edu/">http://vst.cs.princeton.edu/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/PrincetonUniversity/VST.git">https://github.com/PrincetonUniversity/VST.git</a></dd>
</dl>

<p>
The software toolchain includes static analyzers to check assertions
about your program; optimizing compilers to translate your program to
machine language; operating systems and libraries to supply context
for your program. The Verified Software Toolchain project assures with
machine-checked proofs that the assertions claimed at the top of the
toolchain really hold in the machine-language program, running in the
operating-system context.
</p>

<p>
In some application domains it is not enough to build reliable
software systems, one wants proved-correct software. This is the case
for safety-critical systems (where software bugs can cause injury or
death) and for security-critical applications (where an attacker is
deliberately searching for, and exploiting, software bugs). Since
proofs are large and complex, the proof-checking must be
mechanized. Machine-checked proofs of real software systems are
difficult, but now should be possible, given the recent advances in
the theory and engineering of mechanized proof systems applied to
software verification. But there are several challenges:
</p>

<ul class="org-ul">
<li>Real software systems are usually built from components in different
programming languages.</li>

<li>Some parts of the program need full correctness proofs, which must
be constructed with great effort; other parts need only safety
proofs, which can be constructed automatically.</li>

<li>One reasons about correctness at the source-code level, but one runs
a machine-code program translated by a compiler; the compiler must
be proved correct.</li>

<li>These proofs about different properties, with respect to different
programming languages, must be integrated together end-to-end in a
way that is also proved correct and machine-checked.</li>
</ul>

<p>
We address these challenges by defining Verifiable C, a program logic
for the C programming language. Verifiable C is proved sound with
respect to the operational semantics of CompCert C; in turn, the
CompCert verified optimizing C compiler is proved correct with respect
to the assembly-language semantics of the PowerPC, ARM, and x86
processors.
</p>
</div>
</div>

<div id="outline-container-orgc0ed4f9" class="outline-4">
<h4 id="orgc0ed4f9"><span class="section-number-4">3.1.3</span> CertiKOS - Certified Kit Operating System</h4>
<div class="outline-text-4" id="text-3-1-3">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://flint.cs.yale.edu/certikos/">http://flint.cs.yale.edu/certikos/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/npe9/certikos.git">https://github.com/npe9/certikos.git</a></dd>
</dl>

<p>
Developed by the FLINT group.
</p>
</div>
</div>

<div id="outline-container-org6e1cf0c" class="outline-4">
<h4 id="org6e1cf0c"><span class="section-number-4">3.1.4</span> VeriML</h4>
<div class="outline-text-4" id="text-3-1-4">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://flint.cs.yale.edu/shao/papers/veriml.html">http://flint.cs.yale.edu/shao/papers/veriml.html</a></dd>
<dt>Source</dt><dd><a href="http://flint.cs.yale.edu/flint/publications/veriml-0.1.tar.gz">http://flint.cs.yale.edu/flint/publications/veriml-0.1.tar.gz</a></dd>
<dt>Paper</dt><dd><a href="http://flint.cs.yale.edu/flint/publications/verimltr.pdf">http://flint.cs.yale.edu/flint/publications/verimltr.pdf</a></dd>
</dl>

<p>
Developed by the FLINT group.
</p>

<p>
Modern proof assistants such as Coq and Isabelle provide high degrees
of expressiveness and assurance because they support formal reasoning
in higher-order logic and supply explicit machine-checkable proof
objects. Unfortunately, large scale proof development in these proof
assistants is still an extremely difficult and time-consuming
task. One major weakness of these proof assistants is the lack of a
single language where users can develop complex tactics and decision
procedures using a rich programming model and in a typeful
manner. This limits the scalability of the proof development process,
as users avoid developing domain-specific tactics and decision
procedures.
</p>

<p>
In this paper, we present VeriML&#x2014;a novel language design that
couples a type-safe effectful computational language with first-class
support for manipulating logical terms such as propositions and
proofs. The main idea behind our design is to integrate a rich logical
framework&#x2014;similar to the one supported by Coq&#x2014;inside a
computational language inspired by ML. The language design is such
that the added features are orthogonal to the rest of the
computational language, and also do not require significant additions
to the logic language, so soundness is guaranteed. We have built a
prototype implementation of VeriML including both its type-checker and
an interpreter. We demonstrate the effectiveness of our design by
showing a number of type-safe tactics and decision procedures written
in VeriML.
</p>
</div>
</div>

<div id="outline-container-org2a69e9a" class="outline-4">
<h4 id="org2a69e9a"><span class="section-number-4">3.1.5</span> Certifying Low-Level Programs with Hardware Interrupts and Preemptive Threads</h4>
<div class="outline-text-4" id="text-3-1-5">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://flint.cs.yale.edu/shao/papers/aimjar.html">http://flint.cs.yale.edu/shao/papers/aimjar.html</a></dd>
<dt>Source</dt><dd><a href="http://flint.cs.yale.edu/flint/publications/aim.coq.tar.gz">http://flint.cs.yale.edu/flint/publications/aim.coq.tar.gz</a></dd>
<dt>Local repo</dt><dd>e/certhwint</dd>
</dl>

<p>
Developed by the FLINT group.
</p>
</div>
</div>

<div id="outline-container-org643b5c2" class="outline-4">
<h4 id="org643b5c2"><span class="section-number-4">3.1.6</span> Kami</h4>
<div class="outline-text-4" id="text-3-1-6">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://plv.csail.mit.edu/kami/">http://plv.csail.mit.edu/kami/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/mit-plv/kami">https://github.com/mit-plv/kami</a></dd>
</dl>

<p>
Kami is a library that turns Coq into an IDE for digital hardware
development, based on a clean-slate reimplementation of a core of the
<a href="http://www.bluespec.com/">Bluespec</a> language. We span the gap from mathematical specifications to
hardware circuit descriptions (RTL netlists). We support specifying,
implementing, verifying, and compiling hardware, reasoning at a high
level about particular hardware components but in the end deriving
first-principles Coq theorems about circuits. No part of Kami need be
trusted beside the formalization of low-level (Verilog-style) circuit
descriptions; all other aspects have end-to-end correctness proofs
checked by Coq. Hardware designs are broken into separately verified
modules, reasoned about with a novel take on labeled transition
systems. Furthermore, Coq provides a natural and expressive platform
for metaprogramming, or building verified circuit generators, as for a
memory caching system autogenerated for a particular shape of cache
hierarchy, or a CPU generated given a number of concurrent cores as
input.
</p>
</div>
</div>

<div id="outline-container-org8d0d72b" class="outline-4">
<h4 id="org8d0d72b"><span class="section-number-4">3.1.7</span> Haskell Core Spec</h4>
<div class="outline-text-4" id="text-3-1-7">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://deepspec.org/entry/Project/Haskell+CoreSpec">https://deepspec.org/entry/Project/Haskell+CoreSpec</a></dd>
<dt>Source</dt><dd><a href="https://github.com/sweirich/corespec.git">https://github.com/sweirich/corespec.git</a></dd>
</dl>

<p>
The Haskell CoreSpec Project aims to develop formal specifications for
a high-level, industrially-relevant functional programming
language. In particular, this project targets the core language of the
Glasgow Haskell Compiler, the primary compiler for the Haskell
programming language. GHC has long been used as both an industrial
strength compiler and a platform for language research. The compiler
itself is open source, and has primarily been developed and is
currently maintained by researchers at Microsoft Research,
Cambridge. The CoreSpec project will develop a formal Coq
specification of the GHC Core language, including the syntax, type
system, and semantics, and connect that specification to other
components of the DeepSpec project.
</p>
</div>
</div>
