formal/formal-summary.org
*** Deep Spec Server
- Home Page :: https://deepspec.org/entry/Project/DeepSpec+Web+Server
- Source :: Not available but see Libmicrohttpd below. 


"For a final demo, unifying many of the Expedition threads, we aim to
build a verified web server."

Status: "A team at Penn has begun exploring the design space and
building a first-draft prototype (for now, running on Linux) of a web
server library loosely based on the popular libmicrohttpd.  The goal
of this short-term effort is to understand the integration issues that
will be involved in putting together a fully functional server from
components under development within DeepSpec.  In particular, we want
to understand what demands it will place on CertiKOS in terms of OS
features (IPC, network support, shared-memory processes,
interoperation between native clients and Linux VMs), what
verification challenges it raises for VST, what integration challenges
it poses for using VST and CertiKOS together."

**** GNU Libmicrohttpd
- Home Page :: https://www.gnu.org/software/libmicrohttpd/
- Source :: https://gnunet.org/git/libmicrohttpd.git

*** Kami
- Home Page :: http://plv.csail.mit.edu/kami/
- Source :: https://github.com/mit-plv/kami.git

A Coq framework to support implementing, specifying, verifying, and
compiling Bluespec-style hardware components with high developer
productivity.

*** Verdi
- Home Page :: http://verdi.uwplse.org/
- Source :: https://github.com/uwplse/verdi
- Example :: https://github.com/uwplse/verdi-raft

Verification of distributed systems.

*** Vellvm
- Home Page :: http://www.cis.upenn.edu/~stevez/vellvm/
- Source :: https://github.com/vellvm/vellvm
- Old Source :: https://github.com/vellvm/vellvm-legacy

"The Vellvm project is building a (verified LLVM), a framework for
reasoning about programs expressed in LLVM's intermediate
representation and transformations that operate on it. Vellvm provides
a mechanized formal semantics of LLVM's intermediate representation,
its type system, and properties of its SSA form. The framework is
built using the Coq interactive theorem prover. It includes multiple
operational semantics and proves relations among them to facilitate
different reasoning styles and proof techniques.

Latest Results

During the first year of DeepSpec we

1. worked on developing a new modular semantics for Vellvm, factoring out the memory model

2. made progress on connecting LLVM-IR like SSA semantics with higher-level structural operational semantics 

3. applied low-level language verification techniques to the problem of race detectection instrumentation"

*** Deep Spec Crypto
+ Home Page :: https://deepspec.org/entry/Project/Cryptography
+ Source :: https://github.com/mit-plv/fiat-crypto
+ Papers :: http://adam.chlipala.net/papers/FiatCryptoSP19/FiatCryptoSP19.pdf
            http://www.cs.princeton.edu/~appel/papers/verified-hmac-drbg.pdf

"We are pursuing end-to-end proofs of cryptographic functionality, via
verification of C code at Princeton and synthesis of assembly code at
MIT.  We are considering both cryptographic primitives
(e.g. pseudorandom number generation with VST at Princeton and
elliptic curve operations with fiat-crypto at MIT) and protocols
(verified with the Foundational Cryptography Framework and connected
to results about C and assembly programs)."

*Latest Results*:

Fiat Cryptography is now used in Google's BoringSSL library for
elliptic-curve arithmetic.  As a result, Chrome HTTPS connections now
run our Coq-generated code.  Our upcoming S&P 2019 paper goes into
more detail.

VST verification has recently focused on the primitives HMAC-DGBG and
HKDF -- both clients of HMAC/SHA256, AES, and parts of the TweetNaCl
library. In addition to verifying (families of) primitives, we hope to
soon turn to integration in larger contexts like verified TLS
libraries.

*** DeepSpecDb
- Home Page :: ?
- Source :: https://github.com/PrincetonUniversity/DeepSpecDB
- Papers:
  - VST Verification of B+Trees with Cursors
    http://perso.eleves.ens-rennes.fr/people/Aurele.Barriere/papers/vstbtrees.pdf
  - Implementing a high-performance key-value store using a trie of
    B+-Trees with cursors.
    https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/adewale/Masters_Thesis.pdf
  - Project Report on DeepSpecDB
    https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/luke/report.pdf
  - The Theory and Verification of B+Tree Cursor Relations
    https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/mcswiggen/McSwiggen-Thesis.pdf

*** Fiat
- Home Page :: http://plv.csail.mit.edu/fiat/
- Source :: https://github.com/mit-plv/fiat.git

"Fiat is a library for the Coq proof assistant for synthesizing
efficient correct-by-construction programs from declarative
specifications. Programming by Fiat starts with a high-level
description of a program, which can be written using libraries of
specification languages for describing common programming tasks like
querying a relational database. These specifications are then
iteratively refined into efficient implementations via automated
tactics. Each derivation in Fiat produces a formal proof trail
certifying that the synthesized program meets the original
specification. Code synthesized by Fiat can be extracted to an
equivalent OCaml program that can be compiled and run as normal."

*** Narcissus
- Home Page :: https://www.cs.purdue.edu/homes/bendy/Narcissus/
- Source :: https://github.com/mit-plv/fiat/tree/master/src/Narcissus
- Papers :: NARCISSUS: Deriving Correct-By-Construction Decoders and Encoders from Binary Formats
            https://www.cs.purdue.edu/homes/bendy/Narcissus/narcissus.pdf
- Video :: https://deepspec.org/event/dsss18/videos.html Scroll to video

Narcissus is part of the fiat project to derive
Correct-By-Construction Decoders and Encoders from Binary Formats.

