formal/formal-summary.html

<div id="outline-container-org059cfc6" class="outline-4">
<h4 id="org059cfc6"><span class="section-number-4">3.1.8</span> Deep Spec Server</h4>
<div class="outline-text-4" id="text-3-1-8">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://deepspec.org/entry/Project/DeepSpec+Web+Server">https://deepspec.org/entry/Project/DeepSpec+Web+Server</a></dd>
<dt>Source</dt><dd>Not available but see Libmicrohttpd below.</dd>
</dl>


<p>
"For a final demo, unifying many of the Expedition threads, we aim to
build a verified web server."
</p>

<p>
Status: "A team at Penn has begun exploring the design space and
building a first-draft prototype (for now, running on Linux) of a web
server library loosely based on the popular libmicrohttpd.  The goal
of this short-term effort is to understand the integration issues that
will be involved in putting together a fully functional server from
components under development within DeepSpec.  In particular, we want
to understand what demands it will place on CertiKOS in terms of OS
features (IPC, network support, shared-memory processes,
interoperation between native clients and Linux VMs), what
verification challenges it raises for VST, what integration challenges
it poses for using VST and CertiKOS together."
</p>
</div>

<div id="outline-container-org8618f94" class="outline-5">
<h5 id="org8618f94"><span class="section-number-5">3.1.8.1</span> GNU Libmicrohttpd</h5>
<div class="outline-text-5" id="text-3-1-8-1">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://www.gnu.org/software/libmicrohttpd/">https://www.gnu.org/software/libmicrohttpd/</a></dd>
<dt>Source</dt><dd><a href="https://gnunet.org/git/libmicrohttpd.git">https://gnunet.org/git/libmicrohttpd.git</a></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org7b36d71" class="outline-4">
<h4 id="org7b36d71"><span class="section-number-4">3.1.9</span> Kami</h4>
<div class="outline-text-4" id="text-3-1-9">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://plv.csail.mit.edu/kami/">http://plv.csail.mit.edu/kami/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/mit-plv/kami.git">https://github.com/mit-plv/kami.git</a></dd>
</dl>

<p>
A Coq framework to support implementing, specifying, verifying, and
compiling Bluespec-style hardware components with high developer
productivity.
</p>
</div>
</div>

<div id="outline-container-orgc3a8fcd" class="outline-4">
<h4 id="orgc3a8fcd"><span class="section-number-4">3.1.10</span> Verdi</h4>
<div class="outline-text-4" id="text-3-1-10">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://verdi.uwplse.org/">http://verdi.uwplse.org/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/uwplse/verdi">https://github.com/uwplse/verdi</a></dd>
<dt>Example</dt><dd><a href="https://github.com/uwplse/verdi-raft">https://github.com/uwplse/verdi-raft</a></dd>
</dl>

<p>
Verification of distributed systems.
</p>
</div>
</div>

<div id="outline-container-org15eb98e" class="outline-4">
<h4 id="org15eb98e"><span class="section-number-4">3.1.11</span> Vellvm</h4>
<div class="outline-text-4" id="text-3-1-11">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://www.cis.upenn.edu/~stevez/vellvm/">http://www.cis.upenn.edu/~stevez/vellvm/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/vellvm/vellvm">https://github.com/vellvm/vellvm</a></dd>
<dt>Old Source</dt><dd><a href="https://github.com/vellvm/vellvm-legacy">https://github.com/vellvm/vellvm-legacy</a></dd>
</dl>

<p>
"The Vellvm project is building a (verified LLVM), a framework for
reasoning about programs expressed in LLVM's intermediate
representation and transformations that operate on it. Vellvm provides
a mechanized formal semantics of LLVM's intermediate representation,
its type system, and properties of its SSA form. The framework is
built using the Coq interactive theorem prover. It includes multiple
operational semantics and proves relations among them to facilitate
different reasoning styles and proof techniques.
</p>

<p>
Latest Results
</p>

<p>
During the first year of DeepSpec we
</p>

<ol class="org-ol">
<li>worked on developing a new modular semantics for Vellvm, factoring out the memory model</li>

<li>made progress on connecting LLVM-IR like SSA semantics with higher-level structural operational semantics</li>

<li>applied low-level language verification techniques to the problem of race detectection instrumentation"</li>
</ol>
</div>
</div>

<div id="outline-container-orgeb5f924" class="outline-4">
<h4 id="orgeb5f924"><span class="section-number-4">3.1.12</span> Deep Spec Crypto</h4>
<div class="outline-text-4" id="text-3-1-12">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://deepspec.org/entry/Project/Cryptography">https://deepspec.org/entry/Project/Cryptography</a></dd>
<dt>Source</dt><dd><a href="https://github.com/mit-plv/fiat-crypto">https://github.com/mit-plv/fiat-crypto</a></dd>
<dt>Papers</dt><dd><a href="http://adam.chlipala.net/papers/FiatCryptoSP19/FiatCryptoSP19.pdf">http://adam.chlipala.net/papers/FiatCryptoSP19/FiatCryptoSP19.pdf</a>
<a href="http://www.cs.princeton.edu/~appel/papers/verified-hmac-drbg.pdf">http://www.cs.princeton.edu/~appel/papers/verified-hmac-drbg.pdf</a></dd>
</dl>

<p>
"We are pursuing end-to-end proofs of cryptographic functionality, via
verification of C code at Princeton and synthesis of assembly code at
MIT.  We are considering both cryptographic primitives
(e.g. pseudorandom number generation with VST at Princeton and
elliptic curve operations with fiat-crypto at MIT) and protocols
(verified with the Foundational Cryptography Framework and connected
to results about C and assembly programs)."
</p>

<p>
<b>Latest Results</b>:
</p>

<p>
Fiat Cryptography is now used in Google's BoringSSL library for
elliptic-curve arithmetic.  As a result, Chrome HTTPS connections now
run our Coq-generated code.  Our upcoming S&amp;P 2019 paper goes into
more detail.
</p>

<p>
VST verification has recently focused on the primitives HMAC-DGBG and
HKDF &#x2013; both clients of HMAC/SHA256, AES, and parts of the TweetNaCl
library. In addition to verifying (families of) primitives, we hope to
soon turn to integration in larger contexts like verified TLS
libraries.
</p>
</div>
</div>

<div id="outline-container-orgbebcf31" class="outline-4">
<h4 id="orgbebcf31"><span class="section-number-4">3.1.13</span> DeepSpecDb</h4>
<div class="outline-text-4" id="text-3-1-13">
<dl class="org-dl">
<dt>Home Page</dt><dd>?</dd>
<dt>Source</dt><dd><a href="https://github.com/PrincetonUniversity/DeepSpecDB">https://github.com/PrincetonUniversity/DeepSpecDB</a></dd>
<dt>(no term)</dt><dd>Papers:
<ul class="org-ul">
<li>VST Verification of B+Trees with Cursors
<a href="http://perso.eleves.ens-rennes.fr/people/Aurele.Barriere/papers/vstbtrees.pdf">http://perso.eleves.ens-rennes.fr/people/Aurele.Barriere/papers/vstbtrees.pdf</a></li>
<li>Implementing a high-performance key-value store using a trie of
B+-Trees with cursors.
<a href="https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/adewale/Masters_Thesis.pdf">https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/adewale/Masters_Thesis.pdf</a></li>
<li>Project Report on DeepSpecDB
<a href="https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/luke/report.pdf">https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/luke/report.pdf</a></li>
<li>The Theory and Verification of B+Tree Cursor Relations
<a href="https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/mcswiggen/McSwiggen-Thesis.pdf">https://github.com/PrincetonUniversity/DeepSpecDB/blob/master/papers/mcswiggen/McSwiggen-Thesis.pdf</a></li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org457454e" class="outline-4">
<h4 id="org457454e"><span class="section-number-4">3.1.14</span> Fiat</h4>
<div class="outline-text-4" id="text-3-1-14">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://plv.csail.mit.edu/fiat/">http://plv.csail.mit.edu/fiat/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/mit-plv/fiat.git">https://github.com/mit-plv/fiat.git</a></dd>
</dl>

<p>
"Fiat is a library for the Coq proof assistant for synthesizing
efficient correct-by-construction programs from declarative
specifications. Programming by Fiat starts with a high-level
description of a program, which can be written using libraries of
specification languages for describing common programming tasks like
querying a relational database. These specifications are then
iteratively refined into efficient implementations via automated
tactics. Each derivation in Fiat produces a formal proof trail
certifying that the synthesized program meets the original
specification. Code synthesized by Fiat can be extracted to an
equivalent OCaml program that can be compiled and run as normal."
</p>
</div>
</div>

<div id="outline-container-orgf74a63e" class="outline-4">
<h4 id="orgf74a63e"><span class="section-number-4">3.1.15</span> Narcissus</h4>
<div class="outline-text-4" id="text-3-1-15">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://www.cs.purdue.edu/homes/bendy/Narcissus/">https://www.cs.purdue.edu/homes/bendy/Narcissus/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/mit-plv/fiat/tree/master/src/Narcissus">https://github.com/mit-plv/fiat/tree/master/src/Narcissus</a></dd>
<dt>Papers</dt><dd>NARCISSUS: Deriving Correct-By-Construction Decoders and Encoders from Binary Formats
<a href="https://www.cs.purdue.edu/homes/bendy/Narcissus/narcissus.pdf">https://www.cs.purdue.edu/homes/bendy/Narcissus/narcissus.pdf</a></dd>
<dt>Video</dt><dd><a href="https://deepspec.org/event/dsss18/videos.html">https://deepspec.org/event/dsss18/videos.html</a> Scroll to video</dd>
</dl>

<p>
Narcissus is part of the fiat project to derive
Correct-By-Construction Decoders and Encoders from Binary Formats.
</p>
</div>
</div>
