formal/formal-summary.org
*** CertiCoq
- Home Page :: https://www.cs.princeton.edu/~appel/certicoq/
- Source :: https://github.com/PrincetonUniversity/certicoq
- Paper :: http://www.cs.princeton.edu/~appel/papers/certicoq-coqpl.pdf

"The CertiCoq project aims to build a proven-correct compiler for
dependently-typed, functional languages, such as Gallinathe core
language of the Coq proof assistant. A proved-correct compiler
consists of a high-level functional specification, machine-verified
proofs of important properties, such as safety and correctness, and a
mechanism to transport those proofs to the generated machine code. The
project exposes both engineering challenges and foundational questions
about compilers for dependently-typed languages."

*** Template-Coq
- Home Page :: https://template-coq.github.io/template-coq/
- Source :: https://github.com/Template-Coq/template-coq
- Papeers :: https://popl18.sigplan.org/event/coqpl-2018-typed-template-coq

Template Coq is a quoting library for [Coq](http://coq.inria.fr). It
takes `Coq` terms and constructs a representation of their syntax tree as
a `Coq` inductive data type. The representation is based on the kernel's
term representation.

This is used as the first stage of CertiCoq.

*** QuickChick
- Home Page :: https://deepspec.org/entry/Project/QuickChick
- Source :: https://github.com/QuickChick
- Book :: [[https://softwarefoundations.cis.upenn.edu/qc-current/][QuickChick: Property-Based Testing in Coq]]

- Randomized property-based testing plugin for Coq; a clone of Haskell QuickCheck
- Includes a foundational verification framework for testing code
- Includes a mechanism for automatically deriving generators for inductive relations

*** Galois Voting System
- Home Page :: https://galois.com/blog/2009/03/trustworthy-voting-systems/


** Non-DeepSpec Projects
*** CakeML
- Home page :: https://cakeml.org/
- Source :: https://github.com/CakeML/cakeml

"CakeML is a functional programming language and an ecosystem of proofs
and tools built around the language. The ecosystem includes a
proven-correct compiler that can bootstrap itself."

*** VCC - A verifier for Concurrent C
- Home Page :: https://www.microsoft.com/en-us/research/project/vcc-a-verifier-for-concurrent-c/
- Source :: https://github.com/Microsoft/vcc.git

*** Compositional CompCert
- Source :: https://github.com/PrincetonUniversity/compcomp

Compcert supporting separate compilation. Last modified in 2015.

*** GaloisInc Projects
- Home Page :: https://galois.com/
- Source :: https://github.com/GaloisInc
    "Galois develops technology to guarantee the trustworthiness of
    systems where failure is unacceptable.

    We apply cutting edge computer science and mathematics to advance the
    state of the art in software and hardware trustworthiness."

*** Bedrock
- Home Page :: http://plv.csail.mit.edu/bedrock/

*** FSCQ
- Home Page :: http://css.csail.mit.edu/fscq/

A file system verified in Coq using a separation logic for reasoning about crash safety

*** Ur/Web
- Home Page :: http://plv.csail.mit.edu/ur/

* Formal Methods Researchers
Alphabetically by last name, then first.

** Andrew W Appel
- Home Page :: http://www.cs.princeton.edu/~appel/index.html

** Adam Chlipala
- Home Page :: http://adam.chlipala.net/

** Robert Harper
- Home Page :: http://www.cs.cmu.edu/~rwh/

** Benjamin Pierce
- Home Page :: http://www.cis.upenn.edu/~bcpierce/
- LinkedIn :: https://github.com/bcpierce00
Professor Department of Computer and Information Science University of Pennsylvania.
Author of [[http://www.cis.upenn.edu/~bcpierce/sf][Software Foundations]].

** Zhong Shao
- Home Page :: http://cs-www.cs.yale.edu/homes/shao/
