formal/formal-summary.html

<div id="outline-container-org41491e4" class="outline-4">
<h4 id="org41491e4"><span class="section-number-4">3.1.16</span> CertiCoq</h4>
<div class="outline-text-4" id="text-3-1-16">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://www.cs.princeton.edu/~appel/certicoq/">https://www.cs.princeton.edu/~appel/certicoq/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/PrincetonUniversity/certicoq">https://github.com/PrincetonUniversity/certicoq</a></dd>
<dt>Paper</dt><dd><a href="http://www.cs.princeton.edu/~appel/papers/certicoq-coqpl.pdf">http://www.cs.princeton.edu/~appel/papers/certicoq-coqpl.pdf</a></dd>
</dl>

<p>
"The CertiCoq project aims to build a proven-correct compiler for
dependently-typed, functional languages, such as Gallinathe core
language of the Coq proof assistant. A proved-correct compiler
consists of a high-level functional specification, machine-verified
proofs of important properties, such as safety and correctness, and a
mechanism to transport those proofs to the generated machine code. The
project exposes both engineering challenges and foundational questions
about compilers for dependently-typed languages."
</p>
</div>
</div>

<div id="outline-container-orge3b4151" class="outline-4">
<h4 id="orge3b4151"><span class="section-number-4">3.1.17</span> Template-Coq</h4>
<div class="outline-text-4" id="text-3-1-17">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://template-coq.github.io/template-coq/">https://template-coq.github.io/template-coq/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/Template-Coq/template-coq">https://github.com/Template-Coq/template-coq</a></dd>
<dt>Papeers</dt><dd><a href="https://popl18.sigplan.org/event/coqpl-2018-typed-template-coq">https://popl18.sigplan.org/event/coqpl-2018-typed-template-coq</a></dd>
</dl>

<p>
Template Coq is a quoting library for [Coq](<a href="http://coq.inria.fr">http://coq.inria.fr</a>). It
takes `Coq` terms and constructs a representation of their syntax tree as
a `Coq` inductive data type. The representation is based on the kernel's
term representation.
</p>

<p>
This is used as the first stage of CertiCoq.
</p>
</div>
</div>

<div id="outline-container-org70e9c11" class="outline-4">
<h4 id="org70e9c11"><span class="section-number-4">3.1.18</span> QuickChick</h4>
<div class="outline-text-4" id="text-3-1-18">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://deepspec.org/entry/Project/QuickChick">https://deepspec.org/entry/Project/QuickChick</a></dd>
<dt>Source</dt><dd><a href="https://github.com/QuickChick">https://github.com/QuickChick</a></dd>
<dt>Book</dt><dd><a href="https://softwarefoundations.cis.upenn.edu/qc-current/">QuickChick: Property-Based Testing in Coq</a></dd>

<dt>(no term)</dt><dd>Randomized property-based testing plugin for Coq; a clone of Haskell QuickCheck</dd>
<dt>(no term)</dt><dd>Includes a foundational verification framework for testing code</dd>
<dt>(no term)</dt><dd>Includes a mechanism for automatically deriving generators for inductive relations</dd>
</dl>
</div>
</div>

<div id="outline-container-orge5f96bb" class="outline-4">
<h4 id="orge5f96bb"><span class="section-number-4">3.1.19</span> Galois Voting System</h4>
<div class="outline-text-4" id="text-3-1-19">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://galois.com/blog/2009/03/trustworthy-voting-systems/">https://galois.com/blog/2009/03/trustworthy-voting-systems/</a></dd>
</dl>
</div>
</div>
</div>


<div id="outline-container-orgf20d2ba" class="outline-3">
<h3 id="orgf20d2ba"><span class="section-number-3">3.2</span> Non-DeepSpec Projects</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org15ad727" class="outline-4">
<h4 id="org15ad727"><span class="section-number-4">3.2.1</span> CakeML</h4>
<div class="outline-text-4" id="text-3-2-1">
<dl class="org-dl">
<dt>Home page</dt><dd><a href="https://cakeml.org/">https://cakeml.org/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/CakeML/cakeml">https://github.com/CakeML/cakeml</a></dd>
</dl>

<p>
"CakeML is a functional programming language and an ecosystem of proofs
and tools built around the language. The ecosystem includes a
proven-correct compiler that can bootstrap itself."
</p>
</div>
</div>

<div id="outline-container-org6130d35" class="outline-4">
<h4 id="org6130d35"><span class="section-number-4">3.2.2</span> VCC - A verifier for Concurrent C</h4>
<div class="outline-text-4" id="text-3-2-2">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://www.microsoft.com/en-us/research/project/vcc-a-verifier-for-concurrent-c/">https://www.microsoft.com/en-us/research/project/vcc-a-verifier-for-concurrent-c/</a></dd>
<dt>Source</dt><dd><a href="https://github.com/Microsoft/vcc.git">https://github.com/Microsoft/vcc.git</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org25a1d24" class="outline-4">
<h4 id="org25a1d24"><span class="section-number-4">3.2.3</span> Compositional CompCert</h4>
<div class="outline-text-4" id="text-3-2-3">
<dl class="org-dl">
<dt>Source</dt><dd><a href="https://github.com/PrincetonUniversity/compcomp">https://github.com/PrincetonUniversity/compcomp</a></dd>
</dl>

<p>
Compcert supporting separate compilation. Last modified in 2015.
</p>
</div>
</div>

<div id="outline-container-orgbc53d44" class="outline-4">
<h4 id="orgbc53d44"><span class="section-number-4">3.2.4</span> GaloisInc Projects</h4>
<div class="outline-text-4" id="text-3-2-4">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="https://galois.com/">https://galois.com/</a></dd>
<dt>Source</dt><dd><p>
<a href="https://github.com/GaloisInc">https://github.com/GaloisInc</a>
"Galois develops technology to guarantee the trustworthiness of
systems where failure is unacceptable.
</p>

<p>
We apply cutting edge computer science and mathematics to advance the
state of the art in software and hardware trustworthiness."
</p></dd>
</dl>
</div>
</div>

<div id="outline-container-org5ea7477" class="outline-4">
<h4 id="org5ea7477"><span class="section-number-4">3.2.5</span> Bedrock</h4>
<div class="outline-text-4" id="text-3-2-5">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://plv.csail.mit.edu/bedrock/">http://plv.csail.mit.edu/bedrock/</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org8e91acb" class="outline-4">
<h4 id="org8e91acb"><span class="section-number-4">3.2.6</span> FSCQ</h4>
<div class="outline-text-4" id="text-3-2-6">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://css.csail.mit.edu/fscq/">http://css.csail.mit.edu/fscq/</a></dd>
</dl>

<p>
A file system verified in Coq using a separation logic for reasoning about crash safety
</p>
</div>
</div>

<div id="outline-container-orgb74bde2" class="outline-4">
<h4 id="orgb74bde2"><span class="section-number-4">3.2.7</span> Ur/Web</h4>
<div class="outline-text-4" id="text-3-2-7">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://plv.csail.mit.edu/ur/">http://plv.csail.mit.edu/ur/</a></dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-orga683e5a" class="outline-2">
<h2 id="orga683e5a"><span class="section-number-2">4</span> Formal Methods Researchers</h2>
<div class="outline-text-2" id="text-4">
<p>
Alphabetically by last name, then first.
</p>
</div>

<div id="outline-container-org0f4e153" class="outline-3">
<h3 id="org0f4e153"><span class="section-number-3">4.1</span> Andrew W Appel</h3>
<div class="outline-text-3" id="text-4-1">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://www.cs.princeton.edu/~appel/index.html">http://www.cs.princeton.edu/~appel/index.html</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org81f9ee6" class="outline-3">
<h3 id="org81f9ee6"><span class="section-number-3">4.2</span> Adam Chlipala</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://adam.chlipala.net/">http://adam.chlipala.net/</a></dd>
</dl>
</div>
</div>

<div id="outline-container-org6e95bd1" class="outline-3">
<h3 id="org6e95bd1"><span class="section-number-3">4.3</span> Robert Harper</h3>
<div class="outline-text-3" id="text-4-3">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://www.cs.cmu.edu/~rwh/">http://www.cs.cmu.edu/~rwh/</a></dd>
</dl>
</div>
</div>

<div id="outline-container-orgcef1342" class="outline-3">
<h3 id="orgcef1342"><span class="section-number-3">4.4</span> Benjamin Pierce</h3>
<div class="outline-text-3" id="text-4-4">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://www.cis.upenn.edu/~bcpierce/">http://www.cis.upenn.edu/~bcpierce/</a></dd>
<dt>LinkedIn</dt><dd><a href="https://github.com/bcpierce00">https://github.com/bcpierce00</a></dd>
</dl>
<p>
Professor Department of Computer and Information Science University of Pennsylvania.
Author of <a href="http://www.cis.upenn.edu/~bcpierce/sf">Software Foundations</a>.
</p>
</div>
</div>

<div id="outline-container-orge613bc1" class="outline-3">
<h3 id="orge613bc1"><span class="section-number-3">4.5</span> Zhong Shao</h3>
<div class="outline-text-3" id="text-4-5">
<dl class="org-dl">
<dt>Home Page</dt><dd><a href="http://cs-www.cs.yale.edu/homes/shao/">http://cs-www.cs.yale.edu/homes/shao/</a></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: SS-FORDR-LAP</p>
<p class="date">Created: 2018-11-21 Wed 15:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
